{"format": "graph-model", "generatedBy": "2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"nearby_body": {"name": "nearby_body:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}]}}, "vel": {"name": "vel:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}}, "snake_pos:0": {"name": "snake_pos:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}, "food_pos:0": {"name": "food_pos:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}, "bounds": {"name": "bounds:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "3"}]}}}, "outputs": {"Identity_2:0": {"name": "Identity_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}]}}, "output_1": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}}, "Identity_4:0": {"name": "Identity_4:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}]}}, "output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}, "output_3": {"name": "Identity_3:0", "dtype": "DT_FLOAT", "tensorShape": {}}}}, "modelTopology": {"node": [{"name": "PartitionedCall/model_59/tf.compat.v1.gather_1/GatherV2/indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_59/tf.compat.v1.gather_1/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_22", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "2"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_23", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "3"}, {"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_25", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "3"}, {"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_59/tf.reshape_5/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_27", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "3"}, {"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_59/tf.reshape_4/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_28", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "3"}, {"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_13", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_14", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_15", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_16", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_59/tf.strided_slice_4/StridedSlice/strides", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_59/tf.math.equal/Equal/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_17", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_18", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_59/tf.strided_slice_5/StridedSlice/strides", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_59/tf.concat_3/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_59/tf.expand_dims_2/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_19", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "20"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.expand_dims_3/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_20", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.math.multiply_57/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_21", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.math.multiply_61/Mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.reshape_3/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_59/tf.__operators__.add/AddV2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "3"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_59/tf.compat.v1.gather/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_59/tf.reshape/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_59/tf.tile_3/Tile/multiples", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_59/tf.compat.v1.norm_3/norm/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_29", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/PartitionedCall/model_59/tf.math.multiply_68/Mul-broadcastto_shape-0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_59/tf.math.reduce_sum_17/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_59/tf.compat.v1.norm_5/norm/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_31", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/PartitionedCall/model_59/tf.math.multiply_72/Mul-broadcastto_shape-0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_59/tf.math.reduce_sum_5/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_10", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.tile_5/Tile/multiples", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_59/tf.math.reduce_sum_3/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "3"}, {"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_11", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "3"}, {"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_59/tf.strided_slice/StridedSlice/strides", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_59/tf.math.multiply_12/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.math.reduce_sum_7/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_12", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.math.reduce_sum_1/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_59/tf.strided_slice_2/StridedSlice/strides", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_59/tf.math.reduce_sum_9/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_59/tf.expand_dims/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_59/tf.reshape_1/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_59/tf.math.reduce_sum_13/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "3"}, {"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "3"}, {"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_59/tf.tile_1/Tile/multiples", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_59/tf.strided_slice_1/StridedSlice/strides", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_59/tf.math.multiply_16/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_59/tf.strided_slice_3/StridedSlice/strides", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_59/tf.math.reduce_sum_11/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_59/tf.expand_dims_1/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_59/tf.reshape_2/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_59/tf.compat.v1.norm_1/norm/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_59/tf.math.reduce_sum_15/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_59/bounds_dist/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "bounds", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "3"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "food_pos", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "nearby_body", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "5"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "snake_pos", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "vel", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "3"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.cast/Cast", "op": "Cast", "input": ["bounds"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "PartitionedCall/model_59/tf.math.subtract/Sub", "op": "Sub", "input": ["snake_pos", "food_pos"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.compat.v1.gather/GatherV2", "op": "GatherV2", "input": ["vel", "PartitionedCall/model_59/tf.__operators__.add/AddV2", "PartitionedCall/model_59/tf.compat.v1.gather/GatherV2/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT64"}, "batch_dims": {"i": "0"}}}, {"name": "PartitionedCall/model_59/tf.reshape/Reshape", "op": "Reshape", "input": ["vel", "PartitionedCall/model_59/tf.reshape/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_59/tf.tile_1/Tile", "op": "Tile", "input": ["vel", "PartitionedCall/model_59/tf.tile_1/Tile/multiples"], "attr": {"T": {"type": "DT_FLOAT"}, "Tmultiples": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_59/tf.compat.v1.norm_1/norm/ArithmeticOptimizer/ReplaceMulWithSquare_mul", "op": "Square", "input": ["vel"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.math.multiply_4/Mul", "op": "Mul", "input": ["PartitionedCall/model_59/tf.math.subtract/Sub", "unknown_10"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.math.multiply_5/ArithmeticOptimizer/ReplaceMulWithSquare_Mul", "op": "Square", "input": ["PartitionedCall/model_59/tf.math.subtract/Sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.linalg.matmul_1/MatMul", "op": "BatchMatMulV2", "input": ["PartitionedCall/model_59/tf.compat.v1.gather/GatherV2", "vel"], "attr": {"grad_y": {"b": false}, "adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_x": {"b": false}, "adj_y": {"b": false}}}, {"name": "PartitionedCall/model_59/tf.tile_3/Tile", "op": "Tile", "input": ["PartitionedCall/model_59/tf.reshape/Reshape", "PartitionedCall/model_59/tf.tile_3/Tile/multiples"], "attr": {"T": {"type": "DT_FLOAT"}, "Tmultiples": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_59/tf.strided_slice/StridedSlice", "op": "StridedSlice", "input": ["PartitionedCall/model_59/tf.tile_1/Tile", "unknown_7", "unknown_8", "PartitionedCall/model_59/tf.strided_slice/StridedSlice/strides"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT64"}, "begin_mask": {"i": "2"}, "end_mask": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "PartitionedCall/model_59/tf.strided_slice_1/StridedSlice", "op": "StridedSlice", "input": ["PartitionedCall/model_59/tf.tile_1/Tile", "unknown", "unknown_0", "PartitionedCall/model_59/tf.strided_slice_1/StridedSlice/strides"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT64"}, "begin_mask": {"i": "3"}, "end_mask": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "PartitionedCall/model_59/tf.compat.v1.norm_1/norm/Sum", "op": "Sum", "input": ["PartitionedCall/model_59/tf.compat.v1.norm_1/norm/ArithmeticOptimizer/ReplaceMulWithSquare_mul", "PartitionedCall/model_59/tf.compat.v1.norm_1/norm/Sum/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "PartitionedCall/model_59/tf.tile_5/Tile", "op": "Tile", "input": ["PartitionedCall/model_59/tf.math.multiply_4/Mul", "PartitionedCall/model_59/tf.tile_5/Tile/multiples"], "attr": {"T": {"type": "DT_FLOAT"}, "Tmultiples": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_59/tf.math.reduce_sum_1/Sum", "op": "Sum", "input": ["PartitionedCall/model_59/tf.math.multiply_5/ArithmeticOptimizer/ReplaceMulWithSquare_Mul", "PartitionedCall/model_59/tf.math.reduce_sum_1/Sum/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/model_59/tf.math.multiply_12/Mul", "op": "Mul", "input": ["PartitionedCall/model_59/tf.strided_slice/StridedSlice", "PartitionedCall/model_59/tf.math.multiply_12/Mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.math.multiply_16/Mul", "op": "Mul", "input": ["PartitionedCall/model_59/tf.strided_slice_1/StridedSlice", "PartitionedCall/model_59/tf.math.multiply_16/Mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.compat.v1.norm_1/norm/Sqrt", "op": "Rsqrt", "input": ["PartitionedCall/model_59/tf.compat.v1.norm_1/norm/Sum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.math.multiply_20/ArithmeticOptimizer/ReplaceMulWithSquare_Mul", "op": "Square", "input": ["PartitionedCall/model_59/tf.tile_5/Tile"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/food_dist/Sqrt", "op": "Sqrt", "input": ["PartitionedCall/model_59/tf.math.reduce_sum_1/Sum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.tensor_scatter_nd_update/TensorScatterUpdate", "op": "TensorScatterUpdate", "input": ["PartitionedCall/model_59/tf.tile_1/Tile", "unknown_9", "PartitionedCall/model_59/tf.math.multiply_12/Mul"], "attr": {"Tindices": {"type": "DT_INT64"}, "bad_indices_policy": {"s": ""}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.tensor_scatter_nd_update_1/TensorScatterUpdate", "op": "TensorScatterUpdate", "input": ["PartitionedCall/model_59/tf.tile_1/Tile", "unknown_1", "PartitionedCall/model_59/tf.math.multiply_16/Mul"], "attr": {"Tindices": {"type": "DT_INT64"}, "bad_indices_policy": {"s": ""}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.math.divide/truediv", "op": "Mul", "input": ["vel", "PartitionedCall/model_59/tf.compat.v1.norm_1/norm/Sqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.math.reduce_sum_3/Sum", "op": "Sum", "input": ["PartitionedCall/model_59/tf.math.multiply_20/ArithmeticOptimizer/ReplaceMulWithSquare_Mul", "PartitionedCall/model_59/tf.math.reduce_sum_3/Sum/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "Identity_3", "op": "Identity", "input": ["PartitionedCall/model_59/food_dist/Sqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.tensor_scatter_nd_update_2/TensorScatterUpdate", "op": "TensorScatterUpdate", "input": ["PartitionedCall/model_59/tf.tensor_scatter_nd_update/TensorScatterUpdate", "unknown_11", "PartitionedCall/model_59/tf.math.multiply_12/Mul"], "attr": {"bad_indices_policy": {"s": ""}, "Tindices": {"type": "DT_INT64"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.tensor_scatter_nd_update_3/TensorScatterUpdate", "op": "TensorScatterUpdate", "input": ["PartitionedCall/model_59/tf.tensor_scatter_nd_update_1/TensorScatterUpdate", "unknown_2", "PartitionedCall/model_59/tf.math.multiply_16/Mul"], "attr": {"Tindices": {"type": "DT_INT64"}, "bad_indices_policy": {"s": ""}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.math.multiply_24/Mul", "op": "Mul", "input": ["PartitionedCall/model_59/tf.tile_5/Tile", "PartitionedCall/model_59/tf.tensor_scatter_nd_update_2/TensorScatterUpdate"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.math.multiply_28/ArithmeticOptimizer/ReplaceMulWithSquare_Mul", "op": "Square", "input": ["PartitionedCall/model_59/tf.tensor_scatter_nd_update_2/TensorScatterUpdate"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.math.multiply_31/Mul", "op": "Mul", "input": ["PartitionedCall/model_59/tf.tensor_scatter_nd_update_3/TensorScatterUpdate", "PartitionedCall/model_59/tf.cast/Cast"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.math.abs/Abs", "op": "Abs", "input": ["PartitionedCall/model_59/tf.tensor_scatter_nd_update_3/TensorScatterUpdate"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.math.reduce_sum_5/Sum", "op": "Sum", "input": ["PartitionedCall/model_59/tf.math.multiply_24/Mul", "PartitionedCall/model_59/tf.math.reduce_sum_5/Sum/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/model_59/tf.math.reduce_sum_7/Sum", "op": "Sum", "input": ["PartitionedCall/model_59/tf.math.multiply_28/ArithmeticOptimizer/ReplaceMulWithSquare_Mul", "PartitionedCall/model_59/tf.math.reduce_sum_7/Sum/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/model_59/tf.math.multiply_34/Mul", "op": "Mul", "input": ["PartitionedCall/model_59/tf.math.abs/Abs", "snake_pos"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.math.multiply_38/Mul", "op": "Mul", "input": ["PartitionedCall/model_59/tf.math.reduce_sum_3/Sum", "PartitionedCall/model_59/tf.math.reduce_sum_7/Sum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.math.subtract_1/Sub", "op": "Sub", "input": ["PartitionedCall/model_59/tf.math.multiply_31/Mul", "PartitionedCall/model_59/tf.math.multiply_34/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.math.sqrt_1/Sqrt", "op": "Sqrt", "input": ["PartitionedCall/model_59/tf.math.multiply_38/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.strided_slice_2/StridedSlice", "op": "StridedSlice", "input": ["PartitionedCall/model_59/tf.math.subtract_1/Sub", "unknown_5", "unknown_6", "PartitionedCall/model_59/tf.strided_slice_2/StridedSlice/strides"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT64"}, "begin_mask": {"i": "3"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "2"}, "ellipsis_mask": {"i": "0"}}}, {"name": "PartitionedCall/model_59/tf.strided_slice_3/StridedSlice", "op": "StridedSlice", "input": ["PartitionedCall/model_59/tf.math.subtract_1/Sub", "unknown_3", "unknown_4", "PartitionedCall/model_59/tf.strided_slice_3/StridedSlice/strides"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT64"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "2"}, "end_mask": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "PartitionedCall/model_59/tf.math.maximum/Maximum", "op": "Maximum", "input": ["PartitionedCall/model_59/tf.math.sqrt_1/Sqrt", "unknown_12"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.math.reduce_sum_9/Sum", "op": "Sum", "input": ["PartitionedCall/model_59/tf.strided_slice_2/StridedSlice", "PartitionedCall/model_59/tf.math.reduce_sum_9/Sum/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/model_59/tf.math.reduce_sum_11/Sum", "op": "Sum", "input": ["PartitionedCall/model_59/tf.strided_slice_3/StridedSlice", "PartitionedCall/model_59/tf.math.reduce_sum_11/Sum/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/model_59/food_norms/truediv", "op": "RealDiv", "input": ["PartitionedCall/model_59/tf.math.reduce_sum_5/Sum", "PartitionedCall/model_59/tf.math.maximum/Maximum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.expand_dims/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/model_59/tf.math.reduce_sum_9/Sum", "PartitionedCall/model_59/tf.expand_dims/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.expand_dims_1/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/model_59/tf.math.reduce_sum_11/Sum", "PartitionedCall/model_59/tf.expand_dims_1/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.clip_by_value/clip_by_value/Minimum", "op": "Minimum", "input": ["PartitionedCall/model_59/food_norms/truediv", "unknown_13"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_2", "op": "Identity", "input": ["PartitionedCall/model_59/food_norms/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.linalg.matmul_4/MatMul", "op": "MatMul", "input": ["PartitionedCall/model_59/tf.math.divide/truediv", "PartitionedCall/model_59/tf.expand_dims/ExpandDims"], "device": "/device:CPU:0", "attr": {"grad_a": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "PartitionedCall/model_59/tf.linalg.matmul_7/MatMul", "op": "MatMul", "input": ["PartitionedCall/model_59/tf.math.divide/truediv", "PartitionedCall/model_59/tf.expand_dims_1/ExpandDims"], "device": "/device:CPU:0", "attr": {"grad_a": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "PartitionedCall/model_59/tf.clip_by_value/clip_by_value", "op": "Maximum", "input": ["PartitionedCall/model_59/tf.clip_by_value/clip_by_value/Minimum", "unknown_14"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.compat.v1.squeeze_2/Squeeze", "op": "Squeeze", "input": ["PartitionedCall/model_59/tf.linalg.matmul_4/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-1"]}}}}, {"name": "PartitionedCall/model_59/tf.compat.v1.squeeze_4/Squeeze", "op": "Squeeze", "input": ["PartitionedCall/model_59/tf.linalg.matmul_7/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-1"]}}}}, {"name": "PartitionedCall/model_59/tf.reshape_1/Reshape", "op": "Reshape", "input": ["PartitionedCall/model_59/tf.compat.v1.squeeze_2/Squeeze", "PartitionedCall/model_59/tf.reshape_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_59/tf.reshape_2/Reshape", "op": "Reshape", "input": ["PartitionedCall/model_59/tf.compat.v1.squeeze_4/Squeeze", "PartitionedCall/model_59/tf.reshape_2/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_59/tf.math.multiply_49/Mul", "op": "Mul", "input": ["PartitionedCall/model_59/tf.reshape_1/Reshape", "PartitionedCall/model_59/tf.math.divide/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.math.multiply_54/Mul", "op": "Mul", "input": ["PartitionedCall/model_59/tf.reshape_2/Reshape", "PartitionedCall/model_59/tf.math.divide/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.math.reduce_sum_13/Sum", "op": "Sum", "input": ["PartitionedCall/model_59/tf.math.multiply_49/Mul", "PartitionedCall/model_59/tf.math.reduce_sum_13/Sum/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/model_59/tf.math.reduce_sum_15/Sum", "op": "Sum", "input": ["PartitionedCall/model_59/tf.math.multiply_54/Mul", "PartitionedCall/model_59/tf.math.reduce_sum_15/Sum/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/model_59/bounds_dist/concat", "op": "ConcatV2", "input": ["PartitionedCall/model_59/tf.math.reduce_sum_13/Sum", "PartitionedCall/model_59/tf.math.reduce_sum_15/Sum", "PartitionedCall/model_59/bounds_dist/concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.math.equal/Equal", "op": "Equal", "input": ["PartitionedCall/model_59/bounds_dist/concat", "PartitionedCall/model_59/tf.math.equal/Equal/y"], "attr": {"T": {"type": "DT_FLOAT"}, "incompatible_shape_error": {"b": true}}}, {"name": "Identity_4", "op": "Identity", "input": ["PartitionedCall/model_59/bounds_dist/concat"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.cast_1/Cast", "op": "Cast", "input": ["PartitionedCall/model_59/tf.math.equal/Equal"], "attr": {"SrcT": {"type": "DT_BOOL"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "PartitionedCall/model_59/tf.strided_slice_4/StridedSlice", "op": "StridedSlice", "input": ["PartitionedCall/model_59/tf.cast_1/Cast", "unknown_15", "unknown_16", "PartitionedCall/model_59/tf.strided_slice_4/StridedSlice/strides"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT64"}, "begin_mask": {"i": "1"}, "end_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "PartitionedCall/model_59/tf.strided_slice_5/StridedSlice", "op": "StridedSlice", "input": ["PartitionedCall/model_59/tf.cast_1/Cast", "unknown_17", "unknown_18", "PartitionedCall/model_59/tf.strided_slice_5/StridedSlice/strides"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT64"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "PartitionedCall/model_59/tf.concat_3/concat", "op": "ConcatV2", "input": ["PartitionedCall/model_59/tf.clip_by_value/clip_by_value", "PartitionedCall/model_59/tf.strided_slice_4/StridedSlice", "PartitionedCall/model_59/tf.strided_slice_5/StridedSlice", "nearby_body", "PartitionedCall/model_59/tf.concat_3/concat/axis"], "attr": {"N": {"i": "4"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.expand_dims_2/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/model_59/tf.concat_3/concat", "PartitionedCall/model_59/tf.expand_dims_2/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.linalg.matmul_9/MatMul", "op": "MatMul", "input": ["PartitionedCall/model_59/tf.expand_dims_2/ExpandDims", "unknown_19"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "grad_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "PartitionedCall/model_59/tf.compat.v1.squeeze_5/Squeeze", "op": "Squeeze", "input": ["PartitionedCall/model_59/tf.linalg.matmul_9/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-2"]}}}}, {"name": "PartitionedCall/model_59/tf.nn.relu/Relu", "op": "Relu", "input": ["PartitionedCall/model_59/tf.compat.v1.squeeze_5/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.expand_dims_3/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/model_59/tf.nn.relu/Relu", "PartitionedCall/model_59/tf.expand_dims_3/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.linalg.matmul_11/MatMul", "op": "MatMul", "input": ["PartitionedCall/model_59/tf.expand_dims_3/ExpandDims", "unknown_20"], "device": "/device:CPU:0", "attr": {"grad_a": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "PartitionedCall/model_59/tf.compat.v1.squeeze_6/Squeeze", "op": "Squeeze", "input": ["PartitionedCall/model_59/tf.linalg.matmul_11/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-2"]}}}}, {"name": "PartitionedCall/model_59/tf.nn.relu_1/Relu", "op": "Relu", "input": ["PartitionedCall/model_59/tf.compat.v1.squeeze_6/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.math.multiply_57/Mul", "op": "Mul", "input": ["PartitionedCall/model_59/tf.nn.relu_1/Relu", "PartitionedCall/model_59/tf.math.multiply_57/Mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.nn.softmax/wa/Softmax", "op": "Softmax", "input": ["PartitionedCall/model_59/tf.math.multiply_57/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.math.subtract_3/Sub", "op": "Sub", "input": ["PartitionedCall/model_59/tf.nn.softmax/wa/Softmax", "unknown_21"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.math.multiply_64/Mul", "op": "Mul", "input": ["PartitionedCall/model_59/tf.math.subtract_3/Sub", "PartitionedCall/model_59/tf.math.multiply_61/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.math.sin/Sin", "op": "Sin", "input": ["PartitionedCall/model_59/tf.math.multiply_64/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.math.cos/Cos", "op": "Cos", "input": ["PartitionedCall/model_59/tf.math.multiply_64/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.math.negative/Neg", "op": "Neg", "input": ["PartitionedCall/model_59/tf.math.sin/Sin"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.reshape_4/Reshape", "op": "Reshape", "input": ["PartitionedCall/model_59/tf.math.sin/Sin", "PartitionedCall/model_59/tf.reshape_4/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_59/tf.reshape_3/Reshape", "op": "Reshape", "input": ["PartitionedCall/model_59/tf.math.cos/Cos", "PartitionedCall/model_59/tf.reshape_3/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_59/tf.reshape_5/Reshape", "op": "Reshape", "input": ["PartitionedCall/model_59/tf.math.negative/Neg", "PartitionedCall/model_59/tf.reshape_5/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_59/tf.tensor_scatter_nd_update_4/TensorScatterUpdate", "op": "TensorScatterUpdate", "input": ["unknown_22", "unknown_23", "PartitionedCall/model_59/tf.reshape_3/Reshape"], "attr": {"bad_indices_policy": {"s": ""}, "Tindices": {"type": "DT_INT64"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.tensor_scatter_nd_update_5/TensorScatterUpdate", "op": "TensorScatterUpdate", "input": ["PartitionedCall/model_59/tf.tensor_scatter_nd_update_4/TensorScatterUpdate", "unknown_25", "PartitionedCall/model_59/tf.reshape_5/Reshape"], "attr": {"Tindices": {"type": "DT_INT64"}, "bad_indices_policy": {"s": ""}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.tensor_scatter_nd_update_6/TensorScatterUpdate", "op": "TensorScatterUpdate", "input": ["PartitionedCall/model_59/tf.tensor_scatter_nd_update_5/TensorScatterUpdate", "unknown_27", "PartitionedCall/model_59/tf.reshape_4/Reshape"], "attr": {"Tindices": {"type": "DT_INT64"}, "bad_indices_policy": {"s": ""}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.tensor_scatter_nd_update_7/TensorScatterUpdate", "op": "TensorScatterUpdate", "input": ["PartitionedCall/model_59/tf.tensor_scatter_nd_update_6/TensorScatterUpdate", "unknown_28", "PartitionedCall/model_59/tf.reshape_3/Reshape"], "attr": {"bad_indices_policy": {"s": ""}, "Tindices": {"type": "DT_INT64"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.linalg.matmul_13/MatMul", "op": "BatchMatMulV2", "input": ["PartitionedCall/model_59/tf.tensor_scatter_nd_update_7/TensorScatterUpdate", "PartitionedCall/model_59/tf.linalg.matmul_1/MatMul"], "attr": {"adj_x": {"b": false}, "grad_y": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}, "grad_x": {"b": false}}}, {"name": "PartitionedCall/model_59/tf.linalg.matmul_15/ArithmeticOptimizer/FoldTransposeIntoMatMul_MatMul", "op": "BatchMatMulV2", "input": ["PartitionedCall/model_59/tf.compat.v1.gather/GatherV2", "PartitionedCall/model_59/tf.linalg.matmul_13/MatMul"], "attr": {"grad_y": {"b": false}, "adj_x": {"b": true}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}, "grad_x": {"b": false}}}, {"name": "PartitionedCall/model_59/tf.math.add_1/Add", "op": "AddV2", "input": ["PartitionedCall/model_59/tf.linalg.matmul_15/ArithmeticOptimizer/FoldTransposeIntoMatMul_MatMul", "PartitionedCall/model_59/tf.tile_3/Tile"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.compat.v1.norm_3/norm/ArithmeticOptimizer/ReplaceMulWithSquare_mul", "op": "Square", "input": ["PartitionedCall/model_59/tf.math.add_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.compat.v1.norm_3/norm/Sum", "op": "Sum", "input": ["PartitionedCall/model_59/tf.compat.v1.norm_3/norm/ArithmeticOptimizer/ReplaceMulWithSquare_mul", "PartitionedCall/model_59/tf.compat.v1.norm_3/norm/Sum/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "PartitionedCall/model_59/tf.compat.v1.norm_3/norm/Sqrt", "op": "Sqrt", "input": ["PartitionedCall/model_59/tf.compat.v1.norm_3/norm/Sum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.math.maximum_1/Maximum", "op": "Maximum", "input": ["PartitionedCall/model_59/tf.compat.v1.norm_3/norm/Sqrt", "unknown_29"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.math.multiply_68/Mul", "op": "BroadcastTo", "input": ["PartitionedCall/model_59/tf.math.maximum_1/Maximum", "ConstantFolding/PartitionedCall/model_59/tf.math.multiply_68/Mul-broadcastto_shape-0"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.math.divide_2/truediv", "op": "RealDiv", "input": ["PartitionedCall/model_59/tf.math.add_1/Add", "PartitionedCall/model_59/tf.math.multiply_68/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.math.reduce_sum_17/Sum", "op": "Sum", "input": ["PartitionedCall/model_59/tf.math.divide_2/truediv", "PartitionedCall/model_59/tf.math.reduce_sum_17/Sum/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/model_59/tf.compat.v1.norm_5/norm/ArithmeticOptimizer/ReplaceMulWithSquare_mul", "op": "Square", "input": ["PartitionedCall/model_59/tf.math.reduce_sum_17/Sum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.compat.v1.norm_5/norm/Sum", "op": "Sum", "input": ["PartitionedCall/model_59/tf.compat.v1.norm_5/norm/ArithmeticOptimizer/ReplaceMulWithSquare_mul", "PartitionedCall/model_59/tf.compat.v1.norm_5/norm/Sum/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "PartitionedCall/model_59/tf.compat.v1.norm_5/norm/Sqrt", "op": "Sqrt", "input": ["PartitionedCall/model_59/tf.compat.v1.norm_5/norm/Sum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.math.maximum_2/Maximum", "op": "Maximum", "input": ["PartitionedCall/model_59/tf.compat.v1.norm_5/norm/Sqrt", "unknown_31"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.math.multiply_72/Mul", "op": "BroadcastTo", "input": ["PartitionedCall/model_59/tf.math.maximum_2/Maximum", "ConstantFolding/PartitionedCall/model_59/tf.math.multiply_72/Mul-broadcastto_shape-0"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/velocity/truediv", "op": "RealDiv", "input": ["PartitionedCall/model_59/tf.math.reduce_sum_17/Sum", "PartitionedCall/model_59/tf.math.multiply_72/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/tf.compat.v1.gather_1/GatherV2", "op": "GatherV2", "input": ["PartitionedCall/model_59/velocity/truediv", "PartitionedCall/model_59/tf.compat.v1.gather_1/GatherV2/indices", "PartitionedCall/model_59/tf.compat.v1.gather_1/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "Identity_1", "op": "Identity", "input": ["PartitionedCall/model_59/velocity/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_59/next_position/Add", "op": "AddV2", "input": ["snake_pos", "PartitionedCall/model_59/tf.compat.v1.gather_1/GatherV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["PartitionedCall/model_59/next_position/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1994}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "PartitionedCall/model_59/tf.compat.v1.gather_1/GatherV2/indices", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/model_59/tf.compat.v1.gather_1/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "unknown_22", "shape": [3, 2, 2], "dtype": "float32"}, {"name": "unknown_23", "shape": [3, 1, 1, 3], "dtype": "int32"}, {"name": "unknown_25", "shape": [3, 1, 1, 3], "dtype": "int32"}, {"name": "PartitionedCall/model_59/tf.reshape_5/Reshape/shape", "shape": [3], "dtype": "int32"}, {"name": "unknown_27", "shape": [3, 1, 1, 3], "dtype": "int32"}, {"name": "PartitionedCall/model_59/tf.reshape_4/Reshape/shape", "shape": [3], "dtype": "int32"}, {"name": "unknown_28", "shape": [3, 1, 1, 3], "dtype": "int32"}, {"name": "unknown_13", "shape": [], "dtype": "float32"}, {"name": "unknown_14", "shape": [], "dtype": "float32"}, {"name": "unknown_15", "shape": [1], "dtype": "int32"}, {"name": "unknown_16", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/model_59/tf.strided_slice_4/StridedSlice/strides", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/model_59/tf.math.equal/Equal/y", "shape": [], "dtype": "float32"}, {"name": "unknown_17", "shape": [1], "dtype": "int32"}, {"name": "unknown_18", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/model_59/tf.strided_slice_5/StridedSlice/strides", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/model_59/tf.concat_3/concat/axis", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/model_59/tf.expand_dims_2/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "unknown_19", "shape": [16, 20], "dtype": "float32"}, {"name": "PartitionedCall/model_59/tf.expand_dims_3/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "unknown_20", "shape": [20, 3], "dtype": "float32"}, {"name": "PartitionedCall/model_59/tf.math.multiply_57/Mul/y", "shape": [], "dtype": "float32"}, {"name": "unknown_21", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/model_59/tf.math.multiply_61/Mul", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/model_59/tf.reshape_3/Reshape/shape", "shape": [3], "dtype": "int32"}, {"name": "PartitionedCall/model_59/tf.__operators__.add/AddV2", "shape": [3, 2], "dtype": "int32"}, {"name": "PartitionedCall/model_59/tf.compat.v1.gather/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/model_59/tf.reshape/Reshape/shape", "shape": [3], "dtype": "int32"}, {"name": "PartitionedCall/model_59/tf.tile_3/Tile/multiples", "shape": [3], "dtype": "int32"}, {"name": "PartitionedCall/model_59/tf.compat.v1.norm_3/norm/Sum/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "unknown_29", "shape": [], "dtype": "float32"}, {"name": "ConstantFolding/PartitionedCall/model_59/tf.math.multiply_68/Mul-broadcastto_shape-0", "shape": [3], "dtype": "int32"}, {"name": "PartitionedCall/model_59/tf.math.reduce_sum_17/Sum/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/model_59/tf.compat.v1.norm_5/norm/Sum/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "unknown_31", "shape": [], "dtype": "float32"}, {"name": "ConstantFolding/PartitionedCall/model_59/tf.math.multiply_72/Mul-broadcastto_shape-0", "shape": [2], "dtype": "int32"}, {"name": "PartitionedCall/model_59/tf.math.reduce_sum_5/Sum/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "unknown_10", "shape": [1, 1], "dtype": "float32"}, {"name": "PartitionedCall/model_59/tf.tile_5/Tile/multiples", "shape": [2], "dtype": "int32"}, {"name": "PartitionedCall/model_59/tf.math.reduce_sum_3/Sum/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "unknown_9", "shape": [3, 1], "dtype": "int32"}, {"name": "unknown_11", "shape": [3, 1], "dtype": "int32"}, {"name": "unknown_7", "shape": [2], "dtype": "int32"}, {"name": "unknown_8", "shape": [2], "dtype": "int32"}, {"name": "PartitionedCall/model_59/tf.strided_slice/StridedSlice/strides", "shape": [2], "dtype": "int32"}, {"name": "PartitionedCall/model_59/tf.math.multiply_12/Mul/y", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/model_59/tf.math.reduce_sum_7/Sum/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "unknown_12", "shape": [1], "dtype": "float32"}, {"name": "PartitionedCall/model_59/tf.math.reduce_sum_1/Sum/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "unknown_5", "shape": [2], "dtype": "int32"}, {"name": "unknown_6", "shape": [2], "dtype": "int32"}, {"name": "PartitionedCall/model_59/tf.strided_slice_2/StridedSlice/strides", "shape": [2], "dtype": "int32"}, {"name": "PartitionedCall/model_59/tf.math.reduce_sum_9/Sum/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/model_59/tf.expand_dims/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/model_59/tf.reshape_1/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "PartitionedCall/model_59/tf.math.reduce_sum_13/Sum/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "unknown_1", "shape": [3, 1], "dtype": "int32"}, {"name": "unknown_2", "shape": [3, 1], "dtype": "int32"}, {"name": "PartitionedCall/model_59/tf.tile_1/Tile/multiples", "shape": [2], "dtype": "int32"}, {"name": "unknown", "shape": [2], "dtype": "int32"}, {"name": "unknown_0", "shape": [2], "dtype": "int32"}, {"name": 